import pandas as pd
import re

data_path = '/content/drive/MyDrive/Colab_Notebooks/2nd_project/dataset/wine_df_all_save.csv' ##### 경로 수정 #####
df = pd.read_csv(data_path) 

def recommend(slot_dict):
    # 예시) "달지 않은 와인 추천해줘"
    # 1. 맵핑이 필요한 변수 사전 만들기 
    mapping_dict = {"당도": {'안달' : 0, '달지않은': 0, '달지않고': 0, '드라이': 0, '안단': 0,'안달고': 0,'달지않고': 0,'달지않은': 0,
                              '달지않은거': 0, '달지않은거로': 0, '달지않은걸로': 0, '달지않으며': 0, '달지않게': 0, '달달하지않으면': 0,
                              '달달하지않았으면': 0,'달달하지않게': 0, '달달하지않은거': 0, '달달하지않은걸로': 0, '달달하지않은거로': 0,
                              '드라이하게': 0, '드라이한거': 0, '드라이한걸로': 0, '드라이한거로': 0, '드라이했으면': 0, '안달달하게': 0,
                              '안달달했으면': 0, '안달달하고': 0, '안달달한거': 0, '안달달한걸로': 0, '안달달한거로': 0, '안달달한': 0,
                              '안단거': 0, '안달게': 0, '안달며': 0,'안단걸로': 0, '안단거로': 0,
                              '달달한': 1,'달달하고': 1, '달달하지만': 1,'달짝지근': 1,'달달': 1,'달달한거': 1, '달달한걸로': 1, 
                              '달달한거로': 1, '달달으면': 1, '달달하며': 1, '달달하게': 1, '달짝지근하게': 1, '달짝지근하며': 1, 
                              '달짝지근한거': 1, '달짝지근한거로': 1, '달짝지근한걸로': 1, '달짝지근했으면': 1, '달짝지근하고': 1, 
                              '달짝지근': 1, '덜단': 1, '덜단거': 1,
                              '단': 2,'달콤한': 2, '스위트': 2,'많이단': 2,'단거': 2, '단걸로': 2, '단거로': 2, '단게': 2, '달게': 2, 
                              '달며': 2, '달고': 2, '달콤하며': 2, '달콤하고': 2, '달콤한거': 2, '달콤한걸로': 2, '달콤하게': 2, 
                              '달콤한거로': 2, '달콤': 2, '달콤했으면': 2, '스위트하고': 2, '스위트하며': 2, '스위트한거': 2, '스위트하게': 2, 
                              '스위트한걸로': 2, '스위트한거로': 2, '스위트한': 2, '스위트했으면': 2, '스위트로': 2},
                    "바디감": {'가벼운': 0, '라이트': 0, '가볍': 0, '상쾌한': 0,'청량한': 0, '가볍지만': 0,'가벼운걸로': 0, '가벼운거': 0, 
                                '가벼우며': 0, '가벼운거로': 0, '가볍게': 0, '가볍': 0, '가벼웠으면': 0, '라이트한거': 0, '라이트한걸로': 0, 
                                '라이트한거로': 0, '라이트하며': 0, '라이트하게': 0, '라이트하고': 0, '라이트한': 0, '라이트했으면': 0, 
                                '라이트로': 0, '무겁지않았으면': 0, '무겁지않은걸로': 0, '무겁지않은거로': 0, '무겁지않은': 0, '무겁지않고': 0,
                                '무겁지않은거': 0, '무겁지않으며': 0, '무겁지않게': 0, '안무거운': 0, '안무거운거': 0, '안무겁게': 0, 
                                '안무거우며': 0, '안무거운걸로': 0, '안무거운거로': 0, '안무거웠으면': 0, '안무겁고': 0, '상쾌하며': 0, 
                                '상쾌하게': 0, '상쾌하고': 0, '상쾌한걸로': 0, '상쾌한거': 0, '상쾌한거로': 0, '상쾌': 0, '상쾌했으면': 0, 
                                '청량하며': 0, '청량하게': 0, '청량하고': 0, '청량한걸로': 0, '청량한거': 0, '청량한거로': 0, '청량': 0, 
                                '청량했으면': 0,                              
                                '가볍지 않은': 1, '미디엄': 1,'끈적하게': 1,'끈적하고': 1, '끈적하며': 1, '끈적했으면': 1, '끈적한거': 1, 
                                '끈적한걸로': 1, '끈적한거로': 1, '끈적': 1, '가볍지않고': 1, '가볍지않은거': 1, '가볍지않은걸로': 1, 
                                '가볍지않은거로': 1, '가볍지않게': 1, '가볍지않으며': 1, '가볍지않았으면': 1, '진한거': 1, '진한걸로': 1, 
                                '진한거로': 1, '진했으면': 1, '진하게': 1, '진하며': 1, '무거운거': 1, '무거운걸로': 1, '무거운거로': 1, 
                                '무거웠으면': 1, '무거우며': 1, '무겁게': 1, '헤비한거': 1, '헤비한걸로': 1, '헤비한거로': 1, '헤비했으면': 1,
                                '헤비하게': 1, '헤비하고': 1, '헤비한': 1, '헤비하며': 1,'헤비로': 1, '풀바디한': 1, '풀바디로': 1, 
                                '풀바디였으면': 1, '풀바디한걸로': 1, '풀바디한거': 1, '풀바디한거로': 1, '풀바디하게': 1, '풀바디하며': 1, 
                                '풀바디하고': 1, '풀로': 1, '풀이였으면': 1, '풀인걸로': 1, '풀인거': 1, '풀인거로': 1, '풀하고': 1,
                                '진한': 1, '진하고': 1,  '무거운': 1,'무겁고': 1, '헤비': 1, '풀':1, '풀바디': 1, '끈적한': 1, '무겁지만': 1},
                    "산미": {'안신': 0, '안시고': 0,  '시지 않은': 0, '시지않고': 0,'안신거': 0, '안신걸로': 0, '안신거로': 0, '안시었으면': 0,
                              '안셨으면': 0, '안시며': 0, '안시게': 0, '시지않게': 0, '시지않은걸로': 0, '시지않으며': 0, '시지않은거': 0, 
                              '시지않았으면': 0, '시지않은거로': 0,
                              '새콤한': 1,'상큼한': 1, '시지만': 1, '조금시큼한': 1,'상큼하고': 1, '상큼한거': 1, '상큼한거로': 1, 
                              '상큼한걸로': 1, '상큼하며': 1, '상큼하게': 1, '상큼': 1, '상큼했으면': 1, '새콤하고': 1, '새콤한거': 1, 
                              '새콤한거로': 1, '새콤한걸로': 1, '새콤하며': 1, '새콤하게': 1, '새콤': 1, '세콤했으면': 1, '조금시큼한거로': 1,
                              '조금시큼한걸로': 1, '조금시큼한거': 1, '조금시큼하게': 1, '조금시큼하며': 1, '조금시큼': 1, '조금시큼하고': 1,
                              '시고': 2,'신': 2, '시큼한': 2,'시큼하고': 2,'신거': 2, '신걸로': 2, '신거로': 2, '시고': 2, '셨으면': 2,'시게': 2, 
                              '시었으면': 2, '시며': 2, '시큼한거': 2, '시큼한걸로': 2, '시큼한거로': 2, '시큼했으면': 2, '시큼': 2, '시큼하고': 2}}
    
    # 2. slot_dict의 변수 불러오기 
    tmp_df = df 
    filter_order = ['종류', '금액', '당도', '바디감', '산미'] ##### 필터링 조건 우선순위 수정 #####
    for k, v in sorted(slot_dict.items(), key = lambda i: filter_order.index(i[0])):
        # 예시) k : sweetness, v: 달지 않은

        # 필터링할 와인이 5개 이하면 필터링 중단
        if len(tmp_df) <= 5: 
            break 

        if v:
            # 당도/바디감/산미와 같은 맵핑이 필요한 변수의 경우
            if v == '상관없음':
              pass
            else:
              if k in mapping_dict:
                  if v in mapping_dict[k]:
                      v = mapping_dict[k][v]
                  else: # 맵핑 사전에 없는 슬롯이 출력된 경우, 디폴트값을 2로 지정 ex) 달달구리
                      v = 1


              # 3. df에서 조건 걸어서 찾기 - 필터링 후 tmp_df 변수에 저장
              ##### 필터링 방식 수정 : 여러가지 경우로 생각해보세요 #####
              if k == '종류':
                  tmp_df = tmp_df[tmp_df[k] == v]
              elif k == '금액':
                  price = re.search('\d+', v).group()
                  if '이하' in v:
                      tmp_df = tmp_df[tmp_df[k] <= int(price)*10000]
                  ###### elif 정도 in v ######
                  else:
                    tmp_df=tmp_df[(tmp_df[k] <= (int(price) + 1)*10000)&(tmp_df[k] >= (int(price) - 1)*10000)]
              elif k == '당도':
                  if v == 0:
                    tmp_df = tmp_df[tmp_df[k] ==0] # 당도 3으로 exact search를 할 수도 있지만, 3 이상으로 조건을 줄 수도 있습니다
                  elif v == 1:
                    tmp_df = tmp_df[(tmp_df[k] >= 1)&(tmp_df[k] <= 2)]
                  elif v == 2:
                    tmp_df = tmp_df[tmp_df[k] >=3]
              elif k == '바디감':
                  if v == 0:
                    tmp_df = tmp_df[tmp_df[k] <= 2]
                  elif v == 1:
                    tmp_df = tmp_df[tmp_df[k] >= 3]
              elif k == '산미':
                  if v == 0:
                    tmp_df = tmp_df[tmp_df[k] <= 2]
                  elif v == 1:
                    tmp_df = tmp_df[tmp_df[k] == 3]
                  elif v == 2:
                    tmp_df = tmp_df[tmp_df[k] >= 4]
        
    # 4. 걸러진 와인 리스트 추천순위 기준 정렬
    wine_list = tmp_df.sort_values('평점지수')

    ##### 현재 코드는 필터링된 와인 중 추천 순위 1위 와인 출력, 필요한 요소들을 리턴하도록 수정 #####
    return wine_list




if __name__ == "__main__":
    example = {
            "sweetness": "달지 않은",
            "body": "",
            "sourness": "",
            "wine_type": "",
            "price": ""
        }
    print(recommend(example))